app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "start", "created_at", "updated_at", "capacity") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "party"], ["start", "2025-01-09"], ["created_at", "2025-01-09 23:13:10.251094"], ["updated_at", "2025-01-09 23:13:10.251094"], ["capacity", 10]]

  def destroy
    @destroy_success = @event.destroy

    if @destroy_success
      @tickets = Ticket.where(event_id: @event.id)

      @tickets.each do |ticket|
        ticket.destroy
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 2]]
SELECT "tickets".* FROM "tickets" WHERE "tickets"."event_id" = $1  [["event_id", 4]]
DELETE FROM "tickets" WHERE "tickets"."id" = $1  [["id", 6]]