app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."event_id" = $1  [["event_id", 1]]
SELECT "tickets".* FROM "tickets"
---
  def index
    if params[:event_id]
      @tickets = Ticket.where(event_id: params[:event_id])
    else
      @tickets = Ticket.all

SELECT "events".* FROM "events"
---
  def new
    @events = Event.all

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "events" SET "updated_at" = $1, "capacity" = $2 WHERE "events"."id" = $3  [["updated_at", "2025-01-11 01:37:47.473895"], ["capacity", 0], ["id", 6]]
INSERT INTO "tickets" ("user", "category", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user", "543"], ["category", "543"], ["event_id", 5], ["created_at", "2025-01-11 01:34:05.475907"], ["updated_at", "2025-01-11 01:34:05.475907"]]
---
  def create

    @ticket = Ticket.new(ticket_params)

    @ticket_event = Event.find(@ticket.event_id)

    if @ticket_event.capacity < 1
      puts '!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!'
      puts '!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!'
      puts '!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!'
      puts '!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!'
      respond_to do |format|
        format.html { redirect_to '/tickets#index', notice: "Ticket was not created. Event is full.", allow_other_host: true, status: :unprocessable_entity }

      end
    else
      @ticket_event.capacity -= 1
      @ticket_event.save
      respond_to do |format|
        if @ticket.save

DELETE FROM "tickets" WHERE "tickets"."id" = $1  [["id", 12]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "events" SET "updated_at" = $1, "capacity" = $2 WHERE "events"."id" = $3  [["updated_at", "2025-01-11 01:36:26.321389"], ["capacity", 5], ["id", 5]]
---
  def destroy
    @destroy_success = @ticket.destroy

    if @destroy_success
      @event = Event.find(@ticket.event_id)
      @event.capacity += 1
      @event.save